13/data/attachments/1edb22393ef2bfb.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_ec84b77d-e8d8-4426-8a27-1b7fd5a87ea5</nif:username>
            <nif:friendToBeAdded>Kathleen_receive_Friend_84447_6</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>